RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_aupdm.c
    tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_DATA);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  Configure rx fifo
 *
 * @param  cfg: fifo cfg
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_RxFifoConfig(Aupdm_FifoCfg_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_RESOLUTION_TYPE(cfg->resolution));
    CHECK_PARAM(IS_AUPDM_FIFO_AILGN_MODE(cfg->ailgnMode));
    CHECK_PARAM(IS_AUPDM_FIFO_DQR_THRESHOLD_MODE(cfg->dmaThresholdMode));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_RX_DATA_RES, cfg->resolution);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_RX_DATA_MODE, cfg->ailgnMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_RX_DRQ_CNT, cfg->dmaThresholdMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_RX_TRG_LEVEL, cfg->FifoIntThreshold);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_RX_DRQ_EN, cfg->dmaEn);

    BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_AUDPDM_ITF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_ITF_EN, cfg->dmaEn);
    BL_WR_REG(PDM0_BASE, PDM_AUDPDM_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  enable rx fifo
 *
 * @param  ch: ch
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_RxFifoEnable(uint8_t ch)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_RX_CH_EN, ch);
    BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  disable rx fifo
 *
 * @param  ch: fifo cfg
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_RxFifoDisable(uint8_t ch)
{
    uint32_t tmpVal = 0;
    uint32_t tmpVal2 = 0;

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_RX_FIFO_CTRL);
    tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, PDM_RX_CH_EN);

    tmpVal2 &= ~ch;

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_RX_CH_EN, tmpVal2);

    BL_WR_REG(PDM0_BASE, PDM_RX_FIFO_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Select Rx channel form ADC Channel . source Default selction is
 *         rx0-adc_0,rx1-adc_1,rx2-adc_2,rx3-aec_0,rx4-aec_1
 *
 * @param  rx_channel: rx_channel index . Note tx_channel <=4
 * @param  adc_id: rx[rx_channel] conect to adc_id
 *
 * @return Success or not
 *
*******************************************************************************/
BL_Err_Type Aupdm_Rx_Source_ADC_Sel(uint8_t rx_channel, Aupdm_ADC_ID_Type adc_id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_ADC_ID_TYPE(adc_id));

    if (rx_channel > 4) {
        return ERROR;
        /*rx channel sel can not larger than 4*/
    }

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_AUDPDM_ITF);

    switch (rx_channel) {
        case 0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_AUD_RX0_SEL, adc_id);
            break;
        case 1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_AUD_RX1_SEL, adc_id);
            break;
        case 2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_AUD_RX2_SEL, adc_id);
            break;
        default:
            break;
    }

    BL_WR_REG(PDM0_BASE, PDM_AUDPDM_ITF, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  AUPDM ADC enable
 *
 * @param  id: Auido ADC ID
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_ADC_Enable(Aupdm_ADC_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_AUDPDM_ITF);
    if (id == AUPDM_ADC_0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_0_EN);
    } else if (id == AUPDM_ADC_1) {
        tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_1_EN);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_2_EN);
    }
    BL_WR_REG(PDM0_BASE, PDM_AUDPDM_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  AUPDM ADC disable
 *
 * @param  id: Auido ADC ID
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_ADC_Disable(Aupdm_ADC_ID_Type id)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_AUDPDM_ITF);
    if (id == AUPDM_ADC_0) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_0_EN);
    } else if (id == AUPDM_ADC_1) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_1_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_2_EN);
    }
    BL_WR_REG(PDM0_BASE, PDM_AUDPDM_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set adc scaling value
 *
 * @param  id: Auido ADC ID
 * @param  scalingVal: scaling value
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_Set_ADC_Scaling_Value(Aupdm_ADC_ID_Type id, uint8_t scalingVal)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_ADC_0);

    if (id == AUPDM_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_0_SCAL, scalingVal);
    } else if (id == AUPDM_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_1_SCAL, scalingVal);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_2_SCAL, scalingVal);
    }
    BL_WR_REG(PDM0_BASE, PDM_ADC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set fir mode
 *
 * @param  id: Auido ADC ID
 * @param  enable: enable or disable
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_Set_Fir_Mode(Aupdm_ADC_ID_Type id, uint8_t enable)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_ADC_0);

    if (id == AUPDM_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_0_FIR_MODE, enable);
    } else if (id == AUPDM_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_1_FIR_MODE, enable);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_2_FIR_MODE, enable);
    }
    BL_WR_REG(PDM0_BASE, PDM_ADC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  AUPDM Set HPF Parameter
 *
 * @param  id: ADC ID
 * @param  k1_enable: k1 parameter enable
 * @param  k1: k1 parameter in range 4 bit
 * @param  k2_enable: k2 parameter enable
 * @param  k2: k1 parameter in range 4 bit
 *
 * @return None
 *
*******************************************************************************/
void Aupdm_Set_HPF_Parameter(Aupdm_ADC_ID_Type id, uint8_t k1_enable, uint8_t k1, uint8_t k2_enable, uint8_t k2)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUPDM_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(PDM0_BASE, PDM_ADC_1);

    switch (id) {
        case AUPDM_ADC_0:
            if (k1_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_0_K1_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_0_K1, k1);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_0_K1_EN);
            }
            if (k2_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_0_K2_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_0_K2, k2);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_0_K2_EN);
            }
            break;
        case AUPDM_ADC_1:
            if (k1_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_1_K1_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_1_K1, k1);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_1_K1_EN);
            }
            if (k2_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_1_K2_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_1_K2, k2);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_1_K2_EN);
            }
            break;
        case AUPDM_ADC_2:
            if (k1_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_2_K1_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_2_K1, k1);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_2_K1_EN);
            }

            if (k2_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, PDM_ADC_2_K2_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDM_ADC_2_K2, k2);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, PDM_ADC_2_K2_EN);
            }
            break;
        default:
            break;
    }

